In [5]:
import pandas as pd
import numpy as np

2.0

In [9]:
df = pd.DataFrame({'name': ['Manchester City', 'Manchester United', 'Tottenham Hotspur',
       'Liverpool', 'Chelsea', 'Arsenal', 'Burnley', 'Everton',
       'Leicester City', 'Newcastle United', 'Crystal Palace',
       'Bournemouth', 'West Ham United', 'Watford',
       'Brighton and Hove Albion', 'Huddersfield Town', 'Southampton',
       'Swansea City', 'Stoke City', 'West Bromwich Albion'],
    'gf': [106,  68,  74,  84,  62,  74,  36,  44,  56,  39,  45,  45,  48,
        44,  34,  28,  37,  28,  35,  31],
    'ga': [27, 28, 36, 38, 38, 51, 39, 58, 60, 47, 55, 61, 68, 64, 54, 58, 56,
       56, 68, 56],
    'points': [100,  81,  77,  75,  70,  63,  54,  49,  47,  44,  44,  44,  42,
        41,  40,  37,  36,  33,  33,  31]
                                                                   
})

In [13]:
df.head()

                name   gf  ga  points
0    Manchester City  106  27     100
1  Manchester United   68  28      81
2  Tottenham Hotspur   74  36      77
3          Liverpool   84  38      75
4            Chelsea   62  38      70

In [15]:
np.average(np.array(df["gf"]))

50.9

In [16]:
df["gf"].mean()

50.9